//ТУЕС elsys-bg.org
//11Б
//11
//Даниел Николаев Георгиев
//Да се разработи програма, която изисква от потребителя да въведе целочислено число х, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери сумата от cos(z) за всяко z в интервала [0;x) и да се запише като първи елемент в масива. Да се намери сумата от cos(z) за всяко z в интервала [x; 2x) и да се запише като втори елемент в масива. Аналогично да се намерят сумите на cos(z) за всички интервали [Nx; (N+1)x ) и да се запишат като елемент N в масива за всяко N в интервала [0, 10). Масивът да се изведе на стандартния изход.
#include <stdio.h>

const size = 10;

int main(){
	system("clear");
	
	int x;
	do{
		printf("Enter 0<x<10 : ");
		scanf("%d", &x);
	}while(x<=0 || x>=10);
	
	int beg=0, end=x, i, z;
	float n, arr[size];
	
	for(i=0; i<size; i++){
		n =0;
		for(z=beg; z<end; z++){
			n += cos(z);
		}
		beg += x;
		end += x;
		arr[i] = n;
	}
	
	for(i=0; i<size; i++){
		printf("%f\n", arr[i]);
	}

	return 0;
}

