//ТУЕС elsys-bg.org
//11Б
//11
//Даниел Николаев Георгиев
//Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери първото число N в интервала [0; +∞) делящо се на х. Да се намери сумата на всички числа в интервала [0; N] и да се запише като първи елемент в масива. Да се намери второто число N' в интервала [0; +∞) делящо се на x. Да се намери сумата на всички числа в интервала [0, N'] и да се запише като втори елемент в масива. Аналогично да се запълнят и останалите елементи на масива. Масивът да се изведе на стандартния изход.
#include <stdio.h>
//#define DEBUG
int main()
{
	int x;
	do{
		printf("x=");
		scanf("%d", &x);
	}while( x <= 0 || x >= 10 );
	int arr[10],i,n,j,sum=0,c=0;
	for(i=0;c<10;i++)
	{
		if(i%x==0)
		{
			for(j=0;j<=i;j++)
			{
				sum+=j;
			}
			arr[c]=sum;
			c++;
			sum=0;
			#ifdef DEBUG
				printf("%d\n",i);
			#endif
		}
	}
	for(i=0;i<10;i++)
		printf("%d\n",arr[i]);
	return 0;
}
