//ТУЕС elsys-bg.org
//11Б
//11
//Даниел Николаев Георгиев
//Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 100 целочислени елемента. Стойностите на елементите да са случайни числа в интервала [0, 100). Елементите на масива да се подредят така, че числата завършващи на x да са в началото.
#include <stdio.h>
#include <stdlib.h>
#include <time.h>
void main()
{
	srand ( time(NULL) );
	int x,i;
	int arr[100];	
	do{
		printf("x=");
		scanf("%d", &x);
	}while( x < 0 || x >= 10 );
	for(i=0;i<100;i++)
	{
		arr[i]=rand()%100;
	}
	int j=0,temp;
	for(i=0;i<100;i++)
	{
		if(arr[i]%10==x)
		{
			temp=arr[i];
			arr[i]=arr[j];
			arr[j++]=temp;	
		}
	}
	for(i=0;i<100;i++)
	{
		printf("%d\n",arr[i]);
	}
}
