//ТУЕС elsys-bg.org
//11Б
//11
//Даниел Николаев Георгиев
//Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<=x<10. Да се инициализира масив от 10 елемента. Да се намерят първите 10 числа на Фибоначи в [0; +∞), които се делят на x без остатък. Намерените стойности да се зададат като стойности на елементите в масива. Елементите на масива да се изведат на стандартния изход.
#include <stdio.h>
int main()
{
	int a=0,sum;
	int b=1;
	int i=0;
	int x;
	do{
		printf("x=");
		scanf("%d", &x);
	}while( x < 0 || x >= 10 );
	double arr[10];
	while(1)
	{
		sum=a+b;
		a=b;
		b=sum;
		if(a%x==0)
		{
			arr[i++]=a;
		}
		if(i==10)
			break;
	}
	for(i=0;i<10;i++)
		printf("%0.1f\n",arr[i]);
	return 0;
}
